
{
    "dessert": [
      {
        "idMeal": "1",
        "strMeal": "Key Lime Pie",
        "strCategory": "Dessert",
        "strArea": "American",
        "strInstructions": "Heat the oven to 160C/fan 140C/gas 3. Whizz the biscuits to crumbs in a food processor (or put in a strong plastic bag and bash with a rolling pin). Mix with the melted butter and press into the base and up the sides of a 22cm loose-based tart tin. Bake in the oven for 10 minutes. Remove and cool.\r\nPut the egg yolks in a large bowl and whisk for a minute with electric beaters. Add the condensed milk and whisk for 3 minutes then add the zest and juice and whisk again for 3 minutes. Pour the filling into the cooled base then put back in the oven for 15 minutes. Cool then chill for at least 3 hours or overnight if you like.\r\nWhen you are ready to serve, carefully remove the pie from the tin and put on a serving plate. To decorate, softly whip together the cream and icing sugar. Dollop or pipe the cream onto the top of the pie and finish with extra lime zest.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/qpqtuu1511386216.jpg",
        "strTags": "Cake,Pie,Desert,Fruity,Sour",
        "strYoutube": "https://www.youtube.com/watch?v=q4Rz7tUkX9A",
        "strIngredient1": "Digestive Biscuits",
        "strIngredient2": "Butter",
        "strIngredient3": "Condensed Milk",
        "strIngredient4": "Egg Yolks",
        "strIngredient5": "Lime",
        "strIngredient6": "Double Cream",
        "strIngredient7": "Icing Sugar",
        "strIngredient8": "Lime",
        "strMeasure1": "300g",
        "strMeasure2": "150g",
        "strMeasure3": "400g",
        "strMeasure4": "3",
        "strMeasure5": "4",
        "strMeasure6": "300ml ",
        "strMeasure7": "1 tbls",
        "strMeasure8": "to serve",
        "strSource": "https://www.bbcgoodfood.com/recipes/2155644/key-lime-pie",
        "strImageSource": null,
        "strCreativeCommonsConfirmed": null,
        "dateModified": null
      }
      {
        "idMeal": "2",
        "strMeal": "Christmas Pudding Trifle",
        "strCategory": "Dessert",
        "strArea": "British",
        "strInstructions": "Peel the oranges using a sharp knife, ensuring all the pith is removed. Slice as thinly as possible and arrange over a dinner plate. Sprinkle with the demerara sugar followed by the Grand Marnier and set aside.\r\n\r\nCrumble the Christmas pudding into large pieces and scatter over the bottom of a trifle bowl. Lift the oranges onto the pudding in a layer and pour over any juices.\r\n\r\nBeat the mascarpone until smooth, then stir in the custard. Spoon the mixture over the top of the oranges.\r\n\r\nLightly whip the cream and spoon over the custard. Sprinkle with the flaked almonds and grated chocolate. You can make this a day in advance if you like, chill until ready to serve.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/r33cud1576791081.jpg",
        "strTags": "Christmas",
        "strYoutube": "https://www.youtube.com/watch?v=jRfyNQs5qhU",
        "strIngredient1": "Orange",
        "strIngredient2": "Demerara Sugar",
        "strIngredient3": "Grand Marnier",
        "strIngredient4": "Christmas Pudding",
        "strIngredient5": "Custard",
        "strIngredient6": "Mascarpone",
        "strIngredient7": "Double Cream",
        "strIngredient8": "Flaked Almonds",
        "strIngredient9": "Dark Chocolate",
        "strMeasure1": "3",
        "strMeasure2": "1 tbs",
        "strMeasure3": "2 tbs",
        "strMeasure4": "300g",
        "strMeasure5": "500g",
        "strMeasure6": "250g",
        "strMeasure7": "284ml",
        "strMeasure8": "Handful",
        "strMeasure9": "Grated",
        "strSource": "https://www.bbcgoodfood.com/recipes/1826685/christmas-pudding-trifle",
        "strImageSource": null,
        "strCreativeCommonsConfirmed": null,
        "dateModified": null
      }
      {
        "idMeal": "3",
        "strMeal": "Apple & Blackberry Crumble",
        "strCategory": "Dessert",
        "strArea": "British",
        "strInstructions": "Heat oven to 190C/170C fan/gas 5. Tip the flour and sugar into a large bowl. Add the butter, then rub into the flour using your fingertips to make a light breadcrumb texture. Do not overwork it or the crumble will become heavy. Sprinkle the mixture evenly over a baking sheet and bake for 15 mins or until lightly coloured.\r\nMeanwhile, for the compote, peel, core and cut the apples into 2cm dice. Put the butter and sugar in a medium saucepan and melt together over a medium heat. Cook for 3 mins until the mixture turns to a light caramel. Stir in the apples and cook for 3 mins. Add the blackberries and cinnamon, and cook for 3 mins more. Cover, remove from the heat, then leave for 2-3 mins to continue cooking in the warmth of the pan.\r\nTo serve, spoon the warm fruit into an ovenproof gratin dish, top with the crumble mix, then reheat in the oven for 5-10 mins. Serve with vanilla ice cream.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/xvsurr1511719182.jpg",
        "strTags": "Pudding",
        "strYoutube": "https://www.youtube.com/watch?v=4vhcOwVBDO4",
        "strIngredient1": "Plain Flour",
        "strIngredient2": "Caster Sugar",
        "strIngredient3": "Butter",
        "strIngredient4": "Braeburn Apples",
        "strIngredient5": "Butter",
        "strIngredient6": "Demerara Sugar",
        "strIngredient7": "Blackberrys",
        "strIngredient8": "Cinnamon",
        "strIngredient9": "Ice Cream",
        "strMeasure1": "120g",
        "strMeasure2": "60g",
        "strMeasure3": "60g",
        "strMeasure4": "300g",
        "strMeasure5": "30g",
        "strMeasure6": "30g",
        "strMeasure7": "120g",
        "strMeasure8": "¼ teaspoon",
        "strMeasure9": "to serve",
        "strSource": "https://www.bbcgoodfood.com/recipes/778642/apple-and-blackberry-crumble",
        "strImageSource": null,
        "strCreativeCommonsConfirmed": null,
        "dateModified": null
      }
      {
        "idMeal": "52858",
        "strMeal": "New York cheesecake",
        "strCategory": "Dessert",
        "strArea": "American",
        "strInstructions": "Position an oven shelf in the middle of the oven. Preheat the oven to fan 160C/conventional 180C/gas 4. Line the base of a 23cm springform cake tin with parchment paper. For the crust, melt the butter in a medium pan. Stir in the biscuit crumbs and sugar so the mixture is evenly moistened. Press the mixture into the bottom of the pan and bake for 10 minutes. Cool on a wire rack while preparing the filling.\r\nFor the filling, increase the oven temperature to fan 200C/conventional 240C/gas 9. In a table top mixer fitted with the paddle attachment, beat the soft cheese at medium-low speed until creamy, about 2 minutes. With the mixer on low, gradually add the sugar, then the flour and a pinch of salt, scraping down the sides of the bowl and the paddle twice.\r\nSwap the paddle attachment for the whisk. Continue by adding the vanilla, lemon zest and juice. Whisk in the eggs and yolk, one at a time, scraping the bowl and whisk at least twice. Stir the 284ml carton of soured cream until smooth, then measure 200ml/7fl oz (just over 3⁄4 of the carton). Continue on low speed as you add the measured soured cream (reserve the rest). Whisk to blend, but don't over-beat. The batter should be smooth, light and somewhat airy.\r\nBrush the sides of the springform tin with melted butter and put on a baking sheet. Pour in the filling - if there are any lumps, sink them using a knife - the top should be as smooth as possible. Bake for 10 minutes. Reduce oven temperature to fan 90C/conventional 110C/gas 1⁄4 and bake for 25 minutes more. If you gently shake the tin, the filling should have a slight wobble. Turn off the oven and open the oven door for a cheesecake that's creamy in the centre, or leave it closed if you prefer a drier texture. Let cool in the oven for 2 hours. The cheesecake may get a slight crack on top as it cools.\r\nCombine the reserved soured cream with the 142ml carton, the sugar and lemon juice for the topping. Spread over the cheesecake right to the edges. Cover loosely with foil and refrigerate for at least 8 hours or overnight.\r\nRun a round-bladed knife around the sides of the tin to loosen any stuck edges. Unlock the side, slide the cheesecake off the bottom of the tin onto a plate, then slide the parchment paper out from underneath.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/swttys1511385853.jpg",
        "strTags": "Desert,Dairy,Pudding,Cake,Breakfast",
        "strYoutube": "https://www.youtube.com/watch?v=tspdJ6hxqnc",
        "strIngredient1": "Butter",
        "strIngredient2": "Sour Cream",
        "strIngredient3": "Sugar",
        "strIngredient4": "Cream Cheese",
        "strIngredient5": "Caster Sugar",
        "strIngredient6": "Plain Flour",
        "strIngredient7": "Lemon Juice",
        "strIngredient8": "Eggs",
        "strIngredient9": "Sour Cream",
        "strIngredient10": "Sour Cream",
        "strIngredient11": "Caster Sugar",
        "strIngredient12": "Lemon Juice",
        "strMeasure1": "85g",
        "strMeasure2": "140g",
        "strMeasure3": "1tbsp",
        "strMeasure4": "900g",
        "strMeasure5": "250g",
        "strMeasure6": "3 tbs",
        "strMeasure7": "1 ½ teaspoons",
        "strMeasure8": "3 Large",
        "strMeasure9": "250ml",
        "strMeasure10": "150ml",
        "strMeasure11": "1 tbsp",
        "strMeasure12": "2 tsp",
        "strSource": "https://www.bbcgoodfood.com/recipes/2869/new-york-cheesecake",
        "strImageSource": null,
        "strCreativeCommonsConfirmed": null,
        "dateModified": null
      }
    ]
  }